tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void sendNumberInput(const char* name, uint32_t value, uint32_t minValue, uint32_t maxValue) {
    char buf[128];
    snprintf(buf, sizeof(buf), "<input type='number' name='%s' min='%lu' max='%lu' value='%lu'>",
             name,
             static_cast<unsigned long>(minValue),
             static_cast<unsigned long>(maxValue),
             static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(buf);
}

void sendFlowRateInput(const char* name, uint32_t mlPerMin, uint32_t minMlPerMin, uint32_t maxMlPerMin) {
    char value[24];
    char minValue[24];
    char maxValue[24];
    flowRateToText(mlPerMin, value, sizeof(value));
    flowRateToText(minMlPerMin, minValue, sizeof(minValue));
    flowRateToText(maxMlPerMin, maxValue, sizeof(maxValue));
    char buf[512];
    snprintf(buf, sizeof(buf), "<input type='number' name='%s' min='%s' max='%s' step='0.001' value='%s'>",
             name,
             minValue,
             maxValue,
             value);
    Esp32BaseWeb::sendChunk(buf);
}

void sendSettingToggle(const char* title, const char* desc, const char* name, bool checked) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendToggleInput(name, checked);
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendSettingNumber(const char* title,
                       const char* desc,
                       const char* unit,
                       const char* name,
                       uint32_t value,
                       uint32_t minValue,
                       uint32_t maxValue) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendNumberInput(name, value, minValue, maxValue);
    Esp32BaseWeb::sendChunk("<span class='ir-unit'>");
    Esp32BaseWeb::sendChunk(unit);
    Esp32BaseWeb::sendChunk("</span></div></div>");
}

void sendSettingFlowRate(const char* title,
                         const char* desc,
                         const char* name,
                         uint32_t value,
                         uint32_t minValue,
                         uint32_t maxValue) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</span><span class='ir-setting-desc'>");
    Esp32BaseWeb::sendChunk(desc);
    Esp32BaseWeb::sendChunk("</span></div><div class='ir-control'>");
    sendFlowRateInput(name, value, minValue, maxValue);
    Esp32BaseWeb::sendChunk("<span class='ir-unit'>L/min</span></div></div>");
}

void sendContactTypeChoice(ContactType type) {
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>低液位触点类型</span><span class='ir-setting-desc'>按实际缺水传感器接线选择：常开 NO 或常闭 NC。</span></div><div class='ir-control'><div class='ir-choice'>");
    Esp32BaseWeb::sendChunk("<label><input type='radio' name='lowLevelContactType' value='normally_open'");
    sendChecked(type == ContactType::NormallyOpen);
    Esp32BaseWeb::sendChunk(">常开 NO</label><label><input type='radio' name='lowLevelContactType' value='normally_closed'");
    sendChecked(type == ContactType::NormallyClosed);
    Esp32BaseWeb::sendChunk(">常闭 NC</label></div></div></div>");
}

void sendSectionStart(const char* title, const char* note) {
    Esp32BaseWeb::sendChunk("<div class='ir-section'><h3 class='ir-section-title'>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</h3><p class='ir-section-note'>");
    Esp32BaseWeb::sendChunk(note);
    Esp32BaseWeb::sendChunk("</p><div class='ir-setting-list'>");
}

void sendSectionEnd() {
    Esp32BaseWeb::sendChunk("</div></div>");
}

uint32_t maxZoneDurationMinutes();

uint32_t maxCalibrationDurationMinutes() {
    const uint32_t configMax = maxZoneDurationMinutes();
    const uint32_t calibrationMax = kCalibrationMaxDurationSec / 60UL;
    return configMax < calibrationMax ? configMax : calibrationMax;
}

void sendEnabledPill(bool enabled) {
    Esp32BaseWeb::sendChunk(enabled ? "<span class='ir-pill on'>启用</span>" : "<span class='ir-pill'>禁用</span>");
}

uint32_t durationMinutesRounded(uint32_t seconds) {
    return (seconds + 59UL) / 60UL;
}

uint32_t msToSecondsRounded(uint32_t milliseconds) {
    return (milliseconds + 999UL) / 1000UL;
}

const char* runSourceLabel(RunSource source) {
    switch (source) {
        case RunSource::Manual: return "手动浇水";
        case RunSource::Plan: return "自动计划";
        case RunSource::RunPlanNow: return "立即执行计划";
        case RunSource::Calibration: return "校准";
    }
    return "未知";
}

const ZoneConfig* findZoneById(const IrrigationConfig& config, uint8_t zoneId) {
    const uint8_t index = zoneIndexFromId(zoneId);
    if (index >= kMaxZones) {
        return nullptr;
    }
    return &config.zones[index];
}

const char* zoneNameById(const IrrigationConfig& config, uint8_t zoneId) {
    const ZoneConfig* zone = findZoneById(config, zoneId);
    return zone != nullptr ? zone->name : "未知水路";
}

const char* planNameById(const IrrigationConfig& config, uint8_t planId) {
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (plan.used && plan.id == planId) {
            return plan.name;
        }
    }
    return "未知计划";
}

void durationToText(uint32_t seconds, char* out, size_t len) {
    const uint32_t minutes = seconds / 60UL;
    const uint32_t remainSec = seconds % 60UL;
    if (minutes > 0 && remainSec > 0) {
        snprintf(out, len, "%lu 分 %lu 秒",
                 static_cast<unsigned long>(minutes),
                 static_cast<unsigned long>(remainSec));
    } else if (minutes > 0) {
        snprintf(out, len, "%lu 分钟", static_cast<unsigned long>(minutes));
    } else {
        snprintf(out, len, "%lu 秒", static_cast<unsigned long>(remainSec));
    }
}

