tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    IrrigationConfig next = ConfigStore::config();
    next.supply.pumpEnabled = parseBoolParam("pumpEnabled");
    next.supply.lowLevelEnabled = parseBoolParam("lowLevelEnabled");
    char contactType[24];
    if (Esp32BaseWeb::getParam("lowLevelContactType", contactType, sizeof(contactType)) &&
        strcmp(contactType, "normally_closed") == 0) {
        next.supply.lowLevelContactType = ContactType::NormallyClosed;
    } else {
        next.supply.lowLevelContactType = ContactType::NormallyOpen;
    }
    next.supply.pumpStartDelayMs = 0;

    uint32_t value = 0;
    if (!parseU32Param("pumpStopDelaySec", 0, 10, msToSecondsRounded(next.supply.pumpStopDelayMs), value)) {
        Esp32BaseWeb::sendText(400, "停泵后关阀延时无效");
        return;
    }
    next.supply.pumpStopDelayMs = value * 1000UL;

    if (!parseU32Param("lowLevelDebounceSec", 0, 10, msToSecondsRounded(next.supply.lowLevelDebounceMs), value)) {
        Esp32BaseWeb::sendText(400, "低液位消抖时间无效");
        return;
    }
    next.supply.lowLevelDebounceMs = value * 1000UL;

    if (!parseU32Param("pulsesPerLiter", 0, 100000, next.flow.pulsesPerLiter, value)) {
        Esp32BaseWeb::sendText(400, "每升脉冲数无效");
        return;
    }
    next.flow.pulsesPerLiter = value;

    if (!parseU32Param("startupGraceSec", 0, 120, next.flow.startupGraceSec, value)) {
        Esp32BaseWeb::sendText(400, "启动稳定时间无效");
        return;
    }
    next.flow.startupGraceSec = value;

    if (!parseU32Param("noFlowConfirmSec", 1, 600, next.flow.noFlowConfirmSec, value)) {
        Esp32BaseWeb::sendText(400, "无流量确认时间无效");
        return;
    }
    next.flow.noFlowConfirmSec = value;

    if (!parseU32Param("leakWindowSec", 1, 600, next.flow.leakWindowSec, value)) {
        Esp32BaseWeb::sendText(400, "待机漏水检测窗口无效");
        return;
    }
    next.flow.leakWindowSec = value;

    if (!parseU32Param("leakPulseThreshold", 1, 1000, next.flow.leakPulseThreshold, value)) {
        Esp32BaseWeb::sendText(400, "待机漏水脉冲阈值无效");
        return;
    }
    next.flow.leakPulseThreshold = value;

    if (!parseU32Param("lowFlowPercent", 1, 100, next.flow.lowFlowPercent, value)) {
        Esp32BaseWeb::sendText(400, "低流量百分比无效");
        return;
    }
    next.flow.lowFlowPercent = static_cast<uint8_t>(value);

    if (!parseU32Param("highFlowPercent", 100, 1000, next.flow.highFlowPercent, value)) {
        Esp32BaseWeb::sendText(400, "高流量百分比无效");
        return;
    }
    next.flow.highFlowPercent = static_cast<uint16_t>(value);

    if (!parseU32Param("lowHighFlowConfirmSec", 1, 600, next.flow.lowHighFlowConfirmSec, value)) {
        Esp32BaseWeb::sendText(400, "异常流量确认时间无效");
        return;
    }
    next.flow.lowHighFlowConfirmSec = value;

    if (!parseU32Param("pullInSec", 1, 60, msToSecondsRounded(next.valve.pullInMs), value)) {
        Esp32BaseWeb::sendText(400, "电磁阀吸合时间无效");
        return;
    }
    next.valve.pullInMs = value * 1000UL;

    if (!parseU32Param("holdPercent", 1, 100, next.valve.holdPercent, value)) {
        Esp32BaseWeb::sendText(400, "电磁阀保持占空比无效");
        return;
    }
    next.valve.holdPercent = static_cast<uint8_t>(value);

    if (!parseU32Param("maxZoneDurationMin", 1, 360, next.valve.maxZoneDurationSec / 60UL, value)) {
        Esp32BaseWeb::sendText(400, "单路最大浇水时长无效");
        return;
    }
    next.valve.maxZoneDurationSec = value * 60UL;

    if (!ConfigStore::save(next)) {
        Esp32BaseWeb::sendText(400, ConfigStore::lastError());
        return;
    }
    BoardHardware::configure(ConfigStore::config().valve, ConfigStore::config().supply);
    Esp32BaseWeb::redirectSeeOther("/irrigation/settings");
}

void sendRunPanel() {
    Esp32BaseWeb::beginPanel("手动浇水");
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/run/start'><div class='ir-run-list'>");
    const IrrigationConfig& config = ConfigStore::config();
    const uint32_t maxMinutes = maxZoneDurationMinutes();
    bool any = false;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        any = true;
        Esp32BaseWeb::sendChunk("<div class='ir-run-row'><div><b>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</b><span class='ir-help'>本次手动任务会按水路编号顺序执行，填 0 表示跳过。</span></div><div class='ir-input-unit'>");
        char key[8];
        snprintf(key, sizeof(key), "z%u", zone.id);
        sendNumberInput(key, 0, 0, maxMinutes);
        Esp32BaseWeb::sendChunk("<span class='ir-unit'>分钟</span></div></div>");
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>还没有启用水路，请先到水路页面启用实际接线的水路。</div>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='启动手动浇水'");
    if (!any) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></form>");
    Esp32BaseWeb::endPanel();
}

void sendPlanNowPanel() {
    const IrrigationConfig& config = ConfigStore::config();
    bool hasPlan = false;
    const bool flowReady = config.flow.pulsesPerLiter > 0;
    Esp32BaseWeb::beginPanel("立即执行计划");
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/run/plan-now'><div class='ir-plan-now'><div class='ir-card'><div class='ir-field'><label>选择计划</label><span class='ir-help'>立即按所选计划的水路时长顺序执行，不等待计划启动时间。</span><select id='ir-plan-now-select' name='plan'>");
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used || !plan.enabled) {
            continue;
        }
        hasPlan = true;
        char buf[80];
        snprintf(buf, sizeof(buf), "<option value='%u'>", plan.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(plan.name);
        Esp32BaseWeb::sendChunk("</option>");
    }
    Esp32BaseWeb::sendChunk("</select></div><div class='actions'><input type='submit' value='立即执行所选计划'");
    if (!hasPlan || !flowReady) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></div><div>");
    bool firstPreview = true;
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used || !plan.enabled) {
            continue;
        }
        char buf[192];
        snprintf(buf, sizeof(buf), "<div class='ir-plan-preview' data-plan-preview='%u'%s><h3>",
                 plan.id,
                 firstPreview ? "" : " hidden");
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(plan.name);
        Esp32BaseWeb::sendChunk("</h3><p>只预览本计划内容，不能在运行页修改。</p><div class='ir-plan-summary'><span class='ir-pill on'>每日</span><span class='ir-pill'>");
        sendPlanStartSummary(plan);
        Esp32BaseWeb::sendChunk("</span>");
        snprintf(buf, sizeof(buf), "<span class='ir-pill'>%u 个水路</span><span class='ir-pill'>%lu 分钟</span></div>",
                 planEnabledZoneCount(config, plan),
                 static_cast<unsigned long>(durationMinutesRounded(planTotalDurationSec(config, plan))));
        Esp32BaseWeb::sendChunk(buf);
        sendPlanStepList(config, plan);
        Esp32BaseWeb::sendChunk("</div>");
        firstPreview = false;
    }
    if (!hasPlan) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>没有已启用的计划。</div>");
    }
    Esp32BaseWeb::sendChunk("</div></div></form>");
    if (hasPlan) {
        Esp32BaseWeb::sendChunk("<script>(function(){var s=document.getElementById('ir-plan-now-select');if(!s)return;function u(){document.querySelectorAll('[data-plan-preview]').forEach(function(c){c.hidden=c.getAttribute('data-plan-preview')!==s.value;});}s.addEventListener('change',u);u();})();</script>");
    }
    if (!hasPlan) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "没有已启用的计划", "先启用一个计划，才能使用立即执行。");
    } else if (!flowReady) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "流量计未校准", "执行自动计划前需要先设置每升脉冲数。");
    }
    Esp32BaseWeb::endPanel();
}

void sendRunStatusPanel(const char* title, bool includeStop) {
    const StatusSnapshot status = RunController::statusSnapshot();
    const IrrigationConfig& config = ConfigStore::config();
    const WateringRun& run = RunController::currentRun();
    char flow[24];
    char volume[24];
    flowRateToText(status.currentFlowMlPerMin, flow, sizeof(flow));
    snprintf(volume, sizeof(volume), "%lu ml", static_cast<unsigned long>(status.currentRunVolumeMl));

