tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    Esp32BaseWeb::beginPanel(title);
    Esp32BaseWeb::sendChunk("<div class='ir-status-panel'><div><p class='ir-status-title'>");
    Esp32BaseWeb::sendChunk(status.busy ? runStateLabel(status.runState) : "空闲");
    Esp32BaseWeb::sendChunk("</p><p class='ir-status-note'>");
    if (status.busy) {
        Esp32BaseWeb::sendChunk(runSourceLabel(run.source));
        if (run.planId > 0) {
            Esp32BaseWeb::sendChunk(" · ");
            Esp32BaseWeb::writeHtmlEscaped(planNameById(config, run.planId));
        }
    } else {
        Esp32BaseWeb::sendChunk("当前没有正在执行的浇水任务。");
    }
    Esp32BaseWeb::sendChunk("</p></div>");
    if (includeStop && status.busy) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/run/stop'><input class='danger' type='submit' value='停止浇水'></form>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='ir-status-grid'>");

    char value[48];
    if (status.busy && run.currentStep < run.stepCount) {
        snprintf(value, sizeof(value), "%u / %u",
                 static_cast<unsigned>(run.currentStep + 1U),
                 static_cast<unsigned>(run.stepCount));
    } else {
        snprintf(value, sizeof(value), "无");
    }
    Esp32BaseWeb::sendChunk("<div><b>");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("</b><span>步骤进度</span></div><div><b>");
    if (status.activeZoneId > 0) {
        Esp32BaseWeb::writeHtmlEscaped(zoneNameById(config, status.activeZoneId));
    } else {
        Esp32BaseWeb::sendChunk("无");
    }
    Esp32BaseWeb::sendChunk("</b><span>当前水路</span></div><div><b>");
    Esp32BaseWeb::writeHtmlEscaped(flow);
    Esp32BaseWeb::sendChunk("</b><span>当前流量 L/min</span></div><div><b>");
    Esp32BaseWeb::writeHtmlEscaped(volume);
    Esp32BaseWeb::sendChunk("</b><span>当前步骤累计水量</span></div></div>");
    Esp32BaseWeb::endPanel();
}

void sendLastWateringSummary() {
    uint32_t total = 0;
    if (!HistoryService::readPage(1, 1, g_historyViewBuffer, sizeof(g_historyViewBuffer), total) || total == 0) {
        Esp32BaseWeb::sendChunk("<div><b>无</b><span>最近浇水</span></div>");
        return;
    }
    char* line = g_historyViewBuffer;
    while (*line == ' ' || *line == '\r' || *line == '\n' || *line == '\t') {
        ++line;
    }
    StaticJsonDocument<1536> doc;
    if (deserializeJson(doc, line) != DeserializationError::Ok) {
        Esp32BaseWeb::sendChunk("<div><b>不可用</b><span>最近浇水</span></div>");
        return;
    }
    char finished[24];
    epochToText(doc["finishedAt"] | 0, finished, sizeof(finished));
    Esp32BaseWeb::sendChunk("<div><b>");
    Esp32BaseWeb::sendChunk(runResultLabelFromString(doc["result"] | ""));
    Esp32BaseWeb::sendChunk("</b><span>");
    Esp32BaseWeb::writeHtmlEscaped(finished);
    Esp32BaseWeb::sendChunk("</span></div>");
}

void handleDashboardPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    char value[32];

    Esp32BaseWeb::sendHeader("智能浇水");
    Esp32BaseWeb::sendPageTitle("智能浇水", "本地 12V 六路浇水控制器");

    if (status.busy) {
        sendRunStatusPanel("正在运行", true);
    }

    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("运行状态", runStateLabel(status.runState), status.busy ? "正在运行" : "空闲");
    epochToText(status.nextRunEpoch, value, sizeof(value));
    Esp32BaseWeb::sendMetric("下次运行", value, status.nextRunEpoch == 0 ? "没有已启用的计划" : "本地时间");
    Esp32BaseWeb::sendMetric("流量计", ConfigStore::config().flow.pulsesPerLiter > 0 ? "已校准" : "未校准", "自动计划依赖");
    Esp32BaseWeb::sendMetric("供水方式", ConfigStore::config().supply.pumpEnabled ? "外部自吸泵" : "有压水源", ConfigStore::config().supply.lowLevelEnabled ? "缺水保护启用" : "缺水保护禁用");
    Esp32BaseWeb::endMetricGrid();

    Esp32BaseWeb::beginPanel("系统健康");
    Esp32BaseWeb::sendChunk("<div class='ir-kv'>");
    sendLastWateringSummary();
    Esp32BaseWeb::sendChunk("<div><b>");
    Esp32BaseWeb::sendChunk(status.configValid ? "正常" : "异常");
    Esp32BaseWeb::sendChunk("</b><span>配置状态</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().supply.pumpEnabled ? "启用" : "禁用");
    Esp32BaseWeb::sendChunk("</b><span>外部自吸泵供水</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().supply.lowLevelEnabled ? "启用" : "禁用");
    Esp32BaseWeb::sendChunk("</b><span>低液位保护</span></div></div>");
    if (ConfigStore::config().flow.pulsesPerLiter == 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "流量计未校准", "自动计划执行前需要先设置每升脉冲数。");
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleRunPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    Esp32BaseWeb::sendHeader("运行");
    Esp32BaseWeb::sendPageTitle("运行", "手动顺序浇水和立即执行计划");
    if (status.busy) {
        sendRunStatusPanel("当前运行", true);
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "空闲", "当前没有正在执行的浇水任务。");
    }
    sendRunPanel();
    sendPlanNowPanel();
    Esp32BaseWeb::sendFooter();
}

void handleZonesPage() {
    Esp32BaseWeb::sendHeader("水路");
    Esp32BaseWeb::sendPageTitle("水路", "固定 6 路输出，启用实际接线的水路");
    Esp32BaseWeb::beginPanel("水路列表");

    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='ir-data-table'><thead><tr><th>水路</th><th>状态</th><th class='num'>标准流量</th><th class='num'>已配置计划</th><th>说明</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        char buf[256];
        char flowText[24];
        flowRateToText(zone.standardFlowMlPerMin, flowText, sizeof(flowText));
        snprintf(buf, sizeof(buf), "<tr><td><span class='ir-table-title'>水路 %u</span><span class='ir-table-note'>", zone.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</span></td><td>");
        sendEnabledPill(zone.enabled);
        snprintf(buf,
                 sizeof(buf),
                 "</td><td class='num'>%s L/min</td><td class='num'>%u 个</td><td><span class='ir-table-note'>浇水时长在手动任务或计划中设置</span></td><td>",
                 flowText,
                 zonePlanUseCount(config, zone.id));
        Esp32BaseWeb::sendChunk(buf);
        snprintf(buf, sizeof(buf), "<a class='btnlink info' href='/irrigation/zones/edit?id=%u'>配置</a>", zone.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk("</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");

