tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleZoneEditPage() {
    uint8_t zoneId = 0;
    if (!readRequestZoneId(zoneId)) {
        Esp32BaseWeb::sendText(400, "水路编号无效");
        return;
    }
    const ZoneConfig* zone = ZoneService::find(zoneId);
    if (zone == nullptr) {
        Esp32BaseWeb::sendText(404, ZoneService::lastError());
        return;
    }

    char title[32];
    snprintf(title, sizeof(title), "水路 %u", zone->id);
    Esp32BaseWeb::sendHeader(title);
    Esp32BaseWeb::sendPageTitle(title, "配置水路基础信息");
    Esp32BaseWeb::beginPanel("水路配置");
    char buf[128];
    snprintf(buf, sizeof(buf), "<form class='ir-form' method='post' action='/irrigation/zones/save'><input type='hidden' name='id' value='%u'>", zone->id);
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk("<div class='ir-setting-list'>");
    sendSettingToggle("启用水路", "只有启用的水路才会出现在手动浇水和计划配置中。", "enabled", zone->enabled);
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>水路名称</span><span class='ir-setting-desc'>用于页面、计划和运行历史展示。</span></div><div class='ir-control'>");
    sendTextInput("name", zone->name, sizeof(zone->name) - 1);
    Esp32BaseWeb::sendChunk("</div></div>");
    sendSettingFlowRate("标准流量", "用于低流量和高流量判断，校准后可以自动写入。", "standardFlow", zone->standardFlowMlPerMin, 0, 100000);
    Esp32BaseWeb::sendChunk("</div><div class='actions'><a class='btnlink secondary' href='/irrigation/zones'>返回列表</a><input type='submit' value='保存水路'></div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void sendPlanStartFields(const WateringPlan& plan) {
    Esp32BaseWeb::sendChunk("<div class='ir-section'><h3 class='ir-section-title'>启动时间</h3><p class='ir-section-note'>同一个计划可设置多个每日启动时间，水路时长保持一致。</p><div class='ir-time-grid'>");
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        char timeText[8];
        minuteToText(plan.startTimes[i].minuteOfDay, timeText, sizeof(timeText));
        char buf[96];
        Esp32BaseWeb::sendChunk("<div class='ir-time-item'>");
        snprintf(buf, sizeof(buf), "se%u", i);
        sendToggleInput(buf, plan.startTimes[i].enabled);
        snprintf(buf, sizeof(buf), "<div class='ir-field'><label>时间 %u</label><input type='time' name='st%u' value='", i + 1, i);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk(timeText);
        Esp32BaseWeb::sendChunk("'></div></div>");
    }
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendPlanZoneDurationFields(const WateringPlan& plan) {
    Esp32BaseWeb::sendChunk("<div class='ir-section'><h3 class='ir-section-title'>已启用水路时长</h3><p class='ir-section-note'>每个启用水路填写本计划执行时长，填 0 表示该计划跳过该水路。</p><div class='ir-zone-duration'>");
    const IrrigationConfig& config = ConfigStore::config();
    const uint32_t maxMinutes = maxZoneDurationMinutes();
    bool any = false;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        any = true;
        char buf[128];
        Esp32BaseWeb::sendChunk("<div class='ir-field'><label>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</label><div class='ir-input-unit'>");
        char key[8];
        snprintf(key, sizeof(key), "z%u", zone.id);
        sendNumberInput(key, plan.zoneDurationSec[i] / 60UL, 0, maxMinutes);
        Esp32BaseWeb::sendChunk("<span class='ir-unit'>分钟</span></div></div>");
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>还没有启用水路，计划保存后也不会执行有效浇水步骤。</div>");
    }
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendPlanEditForm(const WateringPlan& plan, const char* action, bool isCreate) {
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='");
    Esp32BaseWeb::sendChunk(action);
    Esp32BaseWeb::sendChunk("'>");
    if (!isCreate) {
        char id[64];
        snprintf(id, sizeof(id), "<input type='hidden' name='id' value='%u'>", plan.id);
        Esp32BaseWeb::sendChunk(id);
    }

    Esp32BaseWeb::sendChunk("<div class='ir-setting-list'>");
    sendSettingToggle("启用计划", "启用后按每日启动时间自动执行，也可以在运行页立即执行。", "enabled", plan.enabled);
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>计划名称</span><span class='ir-setting-desc'>用于区分不同季节、上午/下午或不同浇水策略。</span></div><div class='ir-control'>");
    sendTextInput("name", plan.name, sizeof(plan.name) - 1);
    Esp32BaseWeb::sendChunk("</div></div><div class='ir-setting'><div><span class='ir-setting-title'>重复方式</span><span class='ir-setting-desc'>当前产品只支持每日计划，不做复杂重复策略。</span></div><div class='ir-control'><span class='ir-pill on'>每日</span></div></div></div>");
    sendPlanStartFields(plan);
    sendPlanZoneDurationFields(plan);
    Esp32BaseWeb::sendChunk("<div class='actions'>");
    Esp32BaseWeb::sendChunk("<a class='btnlink secondary' href='/irrigation/plans'>返回列表</a>");
    Esp32BaseWeb::sendChunk(isCreate ? "<input type='submit' value='创建计划'>" : "<input type='submit' value='保存计划'>");
    Esp32BaseWeb::sendChunk("</div></form>");
}

void handlePlansPage() {
    Esp32BaseWeb::sendHeader("计划");
    Esp32BaseWeb::sendPageTitle("计划", "每日计划，最多 8 个计划，每个计划最多 4 个启动时间");

    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::beginPanel("计划列表");
    Esp32BaseWeb::sendChunk("<div class='ir-toolbar'><p>计划只支持每日重复；启动时间和各水路时长在计划详情中配置。</p><a class='btnlink info' href='/irrigation/plans/new'>创建计划</a></div>");
    const bool anyPlan = usedPlanCount(config) > 0;
    if (anyPlan) {
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='ir-data-table'><thead><tr><th>计划</th><th>状态</th><th>启动时间</th><th>水路时长</th><th class='num'>总时长</th><th>操作</th></tr></thead><tbody>");
    }
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used) {
            continue;
        }
        char buf[256];
        Esp32BaseWeb::sendChunk("<tr><td><span class='ir-table-title'>");
        Esp32BaseWeb::writeHtmlEscaped(plan.name);
        Esp32BaseWeb::sendChunk("</span><span class='ir-table-note'>每日计划</span></td><td>");
        sendEnabledPill(plan.enabled);
        Esp32BaseWeb::sendChunk("</td><td>");
        sendPlanStartSummary(plan);
        Esp32BaseWeb::sendChunk("</td><td>");
        sendPlanZoneSummary(config, plan);
        snprintf(buf,
                 sizeof(buf),
                 "</td><td class='num'>%lu 分钟<span class='ir-table-note'>%u 个水路</span></td><td>",
                 static_cast<unsigned long>(durationMinutesRounded(planTotalDurationSec(config, plan))),
                 planEnabledZoneCount(config, plan));
        Esp32BaseWeb::sendChunk(buf);
        snprintf(buf, sizeof(buf), "<a class='btnlink info' href='/irrigation/plans/edit?id=%u'>配置</a>", plan.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk("</td></tr>");
    }
    if (anyPlan) {
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
    } else {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>暂无计划。创建计划后，再配置每日启动时间和各水路时长。</div>");
    }
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::sendFooter();
}

void handlePlanNewPage() {
    WateringPlan plan = {};
    plan.id = 0;
    plan.used = true;
    plan.enabled = false;
    snprintf(plan.name, sizeof(plan.name), "新计划");
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        plan.startTimes[i].enabled = i == 0;
        plan.startTimes[i].minuteOfDay = i == 0 ? 7U * 60U : kInvalidMinuteOfDay;
    }
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        plan.zoneDurationSec[i] = 0;
    }

    Esp32BaseWeb::sendHeader("创建计划");
    Esp32BaseWeb::sendPageTitle("创建计划", "每日启动时间和各水路时长");
    Esp32BaseWeb::beginPanel("计划信息");
    sendPlanEditForm(plan, "/irrigation/plans/create", true);
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handlePlanEditPage() {
    uint8_t planId = 0;
    if (!readRequestPlanId(planId)) {
        Esp32BaseWeb::sendText(400, "计划编号无效");
        return;
    }
    const WateringPlan* plan = PlanService::find(planId);
    if (plan == nullptr) {
        Esp32BaseWeb::sendText(404, PlanService::lastError());
        return;
    }

    Esp32BaseWeb::sendHeader(plan->name);
    Esp32BaseWeb::sendPageTitle(plan->name, "每日启动时间和各水路时长");
    Esp32BaseWeb::beginPanel("计划信息");
    sendPlanEditForm(*plan, "/irrigation/plans/save", false);
    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans/delete' onsubmit=\"return confirm('确认删除这个计划？')\"><input type='hidden' name='id' value='");
    char id[8];
    snprintf(id, sizeof(id), "%u", plan->id);
    Esp32BaseWeb::sendChunk(id);
    Esp32BaseWeb::sendChunk("'><div class='ir-danger-line'><input class='danger' type='submit' value='删除计划'></div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleSettingsPage() {
    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::sendHeader("设置");
    Esp32BaseWeb::sendPageTitle("设置", "水源、流量保护和电磁阀驱动");
    if (RunController::busy()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设置已锁定", "请先停止当前浇水任务，再保存全局设置。");
    }

    Esp32BaseWeb::beginPanel("全局设置");
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/settings/save'>");

    sendSectionStart("供水方式与缺水保护", "默认按有压水源工作；启用外部自吸泵供水时，低液位保护才参与防干抽。");
    sendSettingToggle("使用外部自吸泵供水",
                      "启用后，浇水时输出干接点控制信号给外部自吸泵继电器模块；禁用时仅打开水路阀，适用于已有水压的水源。",
                      "pumpEnabled",
                      config.supply.pumpEnabled);
    sendSettingNumber("停泵后关阀延时",
                      "仅外部自吸泵供水时生效。先关闭自吸泵控制信号，水路阀继续打开这段时间后再关闭。",
                      "秒",
                      "pumpStopDelaySec",
                      msToSecondsRounded(config.supply.pumpStopDelayMs),
                      0,
                      10);
    sendSettingToggle("自吸泵缺水保护",
                      "仅外部自吸泵供水时生效。检测到水箱缺水时，禁止启动或停止正在运行的自吸泵。",
                      "lowLevelEnabled",
                      config.supply.lowLevelEnabled);
    sendContactTypeChoice(config.supply.lowLevelContactType);
    sendSettingNumber("低液位消抖时间",
                      "缺水输入需要持续稳定这么久才会生效，避免触点抖动导致误停。",
                      "秒",
                      "lowLevelDebounceSec",
                      msToSecondsRounded(config.supply.lowLevelDebounceMs),
                      0,
                      10);
    sendSectionEnd();

    sendSectionStart("流量检测", "流量计为必配输入，用于校准、无流量保护、漏水检测和异常流量判断。");
    sendSettingNumber("流量计每升脉冲数",
                      "流量计每流过 1 升水产生的脉冲数量；未校准时自动计划不能执行。",
                      "脉冲/L",
                      "pulsesPerLiter",
                      config.flow.pulsesPerLiter,
                      0,
                      100000);
    sendSettingNumber("启动稳定时间",
                      "打开水路后等待水压和流量计脉冲稳定；这段时间内不触发无流量、低流量或高流量判断。",
                      "秒",
                      "startupGraceSec",
                      config.flow.startupGraceSec,
                      0,
                      120);
    sendSettingNumber("无流量确认时间",
                      "启动稳定时间结束后，如果连续这么久没有流量计脉冲，就停止本次浇水。",
                      "秒",
                      "noFlowConfirmSec",
                      config.flow.noFlowConfirmSec,
                      1,
                      600);
    sendSettingNumber("待机漏水检测窗口",
                      "系统空闲时累计流量脉冲的观察窗口，用于发现疑似漏水。",
                      "秒",
                      "leakWindowSec",
                      config.flow.leakWindowSec,
                      1,
                      600);
    sendSettingNumber("待机漏水脉冲阈值",
                      "空闲观察窗口内达到该脉冲数，即认为存在异常流动。",
                      "脉冲",
                      "leakPulseThreshold",
                      config.flow.leakPulseThreshold,
                      1,
                      1000);
    sendSettingNumber("低流量阈值",
                      "运行流量低于水路标准流量的该比例，并持续达到确认时间后，记录低流量提示，不自动停机。",
                      "%",
                      "lowFlowPercent",
                      config.flow.lowFlowPercent,
                      1,
                      100);
    sendSettingNumber("高流量阈值",
                      "运行流量高于水路标准流量的该比例，并持续达到确认时间后，记录高流量提示，不自动停机。",
                      "%",
                      "highFlowPercent",
                      config.flow.highFlowPercent,
                      100,
                      1000);
    sendSettingNumber("异常流量确认时间",
                      "低流量或高流量需要连续持续这么久，才记录异常提示。",
                      "秒",
                      "lowHighFlowConfirmSec",
                      config.flow.lowHighFlowConfirmSec,
                      1,
                      600);
    sendSectionEnd();

    sendSectionStart("电磁阀驱动", "6 路 12V DC 电磁阀为固定输出，驱动参数影响吸合可靠性和发热。");
    sendSettingNumber("全功率吸合时间",
                      "打开电磁阀时先 100% 输出这段时间，确保阀可靠吸合；之后切换到保持占空比。",
                      "秒",
                      "pullInSec",
                      msToSecondsRounded(config.valve.pullInMs),
                      1,
                      60);
    sendSettingNumber("保持占空比",
                      "吸合时间结束后，用该占空比维持电磁阀打开，降低线圈发热。",
                      "%",
                      "holdPercent",
                      config.valve.holdPercent,
                      1,
                      100);
    sendSettingNumber("单路最大时长",
                      "任何手动任务或计划中，单个水路允许设置的最大运行时间。",
                      "分钟",
                      "maxZoneDurationMin",
                      config.valve.maxZoneDurationSec / 60UL,
                      1,
                      360);
    sendSectionEnd();

    Esp32BaseWeb::sendChunk("<div class='actions'><input type='submit' value='保存设置'");
    if (RunController::busy()) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void sendEnabledZoneSelect(uint8_t selectedZoneId) {
    const IrrigationConfig& config = ConfigStore::config();
    if (selectedZoneId == 0 || zoneIndexFromId(selectedZoneId) >= kMaxZones || !config.zones[zoneIndexFromId(selectedZoneId)].enabled) {
        selectedZoneId = firstEnabledZoneId(config);
    }
    Esp32BaseWeb::sendChunk("<select name='zone'>");
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        char buf[80];
        snprintf(buf, sizeof(buf), "<option value='%u'%s>水路 %u ",
                 zone.id,
                 zone.id == selectedZoneId ? " selected" : "",
                 zone.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</option>");
    }
    Esp32BaseWeb::sendChunk("</select>");
}

void sendCalibrationStartCard(const char* title,
                              const char* note,
                              const char* action,
                              uint32_t defaultMinutes,
                              const char* buttonText,
                              bool disabled = false,
                              const char* disabledText = "当前不可启动校准。") {
    const IrrigationConfig& config = ConfigStore::config();
    const bool hasEnabledZone = firstEnabledZoneId(config) != 0;
    Esp32BaseWeb::sendChunk("<div class='ir-calib-card'><h3>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</h3><p>");
    Esp32BaseWeb::sendChunk(note);
    Esp32BaseWeb::sendChunk("</p>");
    if (!hasEnabledZone) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>还没有启用水路，不能启动校准。</div></div>");
        return;
    }
    if (disabled) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>");
        Esp32BaseWeb::sendChunk(disabledText);
        Esp32BaseWeb::sendChunk("</div></div>");
        return;
    }
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='");
    Esp32BaseWeb::sendChunk(action);
    Esp32BaseWeb::sendChunk("'><div class='ir-grid'><div class='ir-field'><label>校准水路</label><span class='ir-help'>选择一个已启用水路，系统会打开该水路并累计流量计脉冲。</span>");
    sendEnabledZoneSelect(firstEnabledZoneId(config));
    Esp32BaseWeb::sendChunk("</div><div class='ir-field'><label>最长出水时间</label><span class='ir-help'>到达这个时间会自动停止，防止接水时误操作导致一直出水。</span><div class='ir-input-unit'>");
    sendNumberInput("maxDurationMin", defaultMinutes, 1, maxCalibrationDurationMinutes());
    Esp32BaseWeb::sendChunk("<span class='ir-unit'>分钟</span></div></div></div><div class='actions'><input type='submit' value='");
    Esp32BaseWeb::sendChunk(buttonText);
    Esp32BaseWeb::sendChunk("'></div></form></div>");
}

void sendCalibrationStartPanel(const CalibrationSnapshot& snapshot) {
    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::beginPanel("开始校准");
    Esp32BaseWeb::sendChunk("<div class='ir-calib-flow'>");
    sendCalibrationStartCard("流量计接水校准",
                             "每次从出水开始接水，停止后输入实际水量。至少 2 次、推荐 3 次，系统用差分/拟合抵消启动阶段影响。",
                             "start_volume",
                             kCalibrationDefaultMaxDurationSec / 60UL,
                             "开始接水样本",
                             snapshot.volumeSampleCount >= kCalibrationMaxVolumeSamples,
                             "当前接水样本已满，请先保存流量计系数或清空样本。");
    sendCalibrationStartCard("水路标准流量校准",
                             config.flow.pulsesPerLiter == 0 ?
                                 "先完成流量计校准或手工录入每升脉冲数；否则无法把脉冲换算成 L/min。" :
                                 "启动稳定时间后采集滑动窗口流速，稳定后建议保存为该 Zone 的标准流量。",
                             "start_standard",
                             kCalibrationDefaultMaxDurationSec / 60UL,
                             "开始标准流量校准",
                             config.flow.pulsesPerLiter == 0,
                             "需要先完成流量计校准，或在设置页手工录入每升脉冲数。");
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();
}

