tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void sendVolumeSamplesPanel(const CalibrationSnapshot& snapshot) {
    Esp32BaseWeb::beginPanel("流量计接水样本");
    if (snapshot.volumeSampleCount == 0) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>暂无接水样本。建议采集 3 次，水量尽量拉开，例如约 2 L、5 L、8 L。</div>");
    } else {
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='ir-data-table'><thead><tr><th class='num'>样本</th><th>Zone</th><th class='num'>脉冲数</th><th class='num'>实测水量</th><th class='num'>本样本比值</th></tr></thead><tbody>");
        for (uint8_t i = 0; i < snapshot.volumeSampleCount && i < kCalibrationMaxVolumeSamples; ++i) {
            const VolumeCalibrationSample& sample = snapshot.volumeSamples[i];
            if (!sample.used) {
                continue;
            }
            char water[24];
            literAmountToText(sample.measuredMl, water, sizeof(water));
            const uint32_t sampleRatio = sample.measuredMl > 0 ?
                static_cast<uint32_t>((static_cast<uint64_t>(sample.pulses) * 1000ULL + sample.measuredMl / 2ULL) / sample.measuredMl) : 0;
            char row[320];
            snprintf(row,
                     sizeof(row),
                     "<tr><td class='num'>%u</td><td>Zone %u</td><td class='num'>%lu</td><td class='num'>%s L</td><td class='num'>%lu 脉冲/L</td></tr>",
                     static_cast<unsigned>(i + 1U),
                     sample.zoneId,
                     static_cast<unsigned long>(sample.pulses),
                     water,
                     static_cast<unsigned long>(sampleRatio));
            Esp32BaseWeb::sendChunk(row);
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
    }

    if (snapshot.volumeFitReady) {
        char spread[24];
        literAmountToText(snapshot.fitWaterSpreadMl, spread, sizeof(spread));
        char buf[512];
        snprintf(buf,
                 sizeof(buf),
                 "<div class='ir-calib-result' style='margin-top:12px'><div><b>%lu</b><span>拟合结果 脉冲/L</span></div><div><b>%ld</b><span>启动偏移诊断</span></div><div><b>%lu.%lu%%</b><span>最大误差</span></div></div>",
                 static_cast<unsigned long>(snapshot.fittedPulsesPerLiter),
                 static_cast<long>(snapshot.fittedStartupOffsetPulses),
                 static_cast<unsigned long>(snapshot.fitMaxErrorPermille / 10UL),
                 static_cast<unsigned long>(snapshot.fitMaxErrorPermille % 10UL));
        Esp32BaseWeb::sendChunk(buf);
        snprintf(buf,
                 sizeof(buf),
                 "<p class='ir-section-note'>样本水量跨度 %s L。%s</p>",
                 spread,
                 snapshot.volumeFitAcceptable ? "样本质量满足保存条件。" : "样本跨度或一致性不足，建议继续采样或清空重测。");
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk("<div class='actions'><form method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='save_volume_fit'><input type='submit' value='保存流量计系数'");
        if (!snapshot.volumeFitAcceptable) {
            Esp32BaseWeb::sendChunk(" disabled");
        }
        Esp32BaseWeb::sendChunk("></form><form method='post' action='/irrigation/calibration/action' onsubmit=\"return confirm('确认清空所有接水样本？')\"><input type='hidden' name='action' value='clear_volume_samples'><input class='secondary' type='submit' value='清空样本'></form></div>");
    } else if (snapshot.volumeSampleCount > 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "继续采样", "至少需要 2 次样本才能计算流量计系数，推荐 3 次。");
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/calibration/action' onsubmit=\"return confirm('确认清空所有接水样本？')\"><input type='hidden' name='action' value='clear_volume_samples'><div class='actions'><input class='secondary' type='submit' value='清空样本'></div></form>");
    }
    Esp32BaseWeb::endPanel();
}

void sendCalibrationResultPanel(const CalibrationSnapshot& snapshot) {
    if (!snapshot.resultReady) {
        return;
    }

    char buf[768];
    Esp32BaseWeb::beginPanel("校准结果");
    snprintf(buf,
             sizeof(buf),
             "<div class='ir-calib-result'><div><b>%s</b><span>校准类型</span></div><div><b>水路 %u</b><span>本次校准水路</span></div><div><b>%lu</b><span>累计脉冲数</span></div></div>",
             calibrationModeLabel(snapshot.mode),
             snapshot.zoneId,
             static_cast<unsigned long>(snapshot.pulses));
    Esp32BaseWeb::sendChunk(buf);

    if (snapshot.mode == CalibrationMode::FlowMeterVolume) {
        Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='save_volume_sample'><div class='ir-field'><label>本次实测水量</label><span class='ir-help'>填写本次从出水开始接到的真实水量。保存为样本后，继续采集下一次；至少 2 次样本才能计算。</span><div class='ir-input-unit'><input type='number' name='measuredL' min='0.001' max='100' step='0.001' value='2'><span class='ir-unit'>L</span></div></div><div class='actions'><input type='submit' value='保存为接水样本'></div></form>");
    } else if (snapshot.mode == CalibrationMode::ZoneStandardFlow) {
        char flowText[24];
        flowRateToText(snapshot.suggestedFlowMlPerMin != 0 ? snapshot.suggestedFlowMlPerMin : snapshot.standardFlowAverageMlPerMin, flowText, sizeof(flowText));
        char minText[24];
        char maxText[24];
        flowRateToText(snapshot.standardFlowMinMlPerMin, minText, sizeof(minText));
        flowRateToText(snapshot.standardFlowMaxMlPerMin, maxText, sizeof(maxText));
        snprintf(buf, sizeof(buf), "<div class='ir-calib-result'><div><b>%s</b><span>稳定状态</span></div><div><b>%s L/min</b><span>窗口最小值</span></div><div><b>%s L/min</b><span>窗口最大值</span></div></div>",
                 snapshot.standardFlowStable ? "已稳定" : "未稳定",
                 minText,
                 maxText);
        Esp32BaseWeb::sendChunk(buf);
        snprintf(buf, sizeof(buf), "<form class='ir-form' method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='save_standard'><input type='hidden' name='zone' value='%u'><div class='ir-field'><label>标准流量</label><span class='ir-help'>保存后用于该水路的低流量和高流量判断。</span><div class='ir-input-unit'><input type='number' name='standardFlow' min='0.001' max='100' step='0.001' value='%s'><span class='ir-unit'>L/min</span></div></div><div class='actions'><input type='submit' value='保存水路标准流量'></div></form>",
                 snapshot.zoneId,
                 flowText);
        Esp32BaseWeb::sendChunk(buf);
        if (!snapshot.standardFlowStable) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "建议人工确认", "本次采样未达到稳定判定，可以继续重测，或按现场判断手工修正后保存。");
        }
    }

    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='clear'><div class='actions'><input type='submit' value='丢弃结果'></div></form>");
    Esp32BaseWeb::endPanel();
}

void handleCalibrationPage() {
    const CalibrationSnapshot snapshot = CalibrationService::snapshot();
    const IrrigationConfig& config = ConfigStore::config();
    const StatusSnapshot status = RunController::statusSnapshot();

    Esp32BaseWeb::sendHeader("校准");
    Esp32BaseWeb::sendPageTitle("校准", "流量计和水路标准流量");

    Esp32BaseWeb::beginMetricGrid();
    char value[32];
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(config.flow.pulsesPerLiter));
    Esp32BaseWeb::sendMetric("每升脉冲数", value, config.flow.pulsesPerLiter == 0 ? "未校准" : "已保存");
    flowRateToText(status.currentFlowMlPerMin, value, sizeof(value));
    Esp32BaseWeb::sendMetric("当前流速", value, "L/min");
    snprintf(value, sizeof(value), "%u / %u", snapshot.volumeSampleCount, kCalibrationMaxVolumeSamples);
    Esp32BaseWeb::sendMetric("接水样本", value, snapshot.volumeFitReady ? "可计算" : "继续采样");
    snprintf(value, sizeof(value), "%u", snapshot.zoneId);
    Esp32BaseWeb::sendMetric("校准水路", value, snapshot.running ? "正在运行" : "空闲");
    Esp32BaseWeb::endMetricGrid();

    if (snapshot.running) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "正在校准", "接够水后可以手动停止，也可以等待设定时长结束。");
        Esp32BaseWeb::beginPanel("停止校准");
        char flowText[24];
        flowRateToText(status.currentFlowMlPerMin, flowText, sizeof(flowText));
        char suggestedText[24];
        flowRateToText(snapshot.suggestedFlowMlPerMin, suggestedText, sizeof(suggestedText));
        Esp32BaseWeb::sendChunk("<div class='ir-calib-result'><div><b>");
        Esp32BaseWeb::sendChunk(calibrationModeLabel(snapshot.mode));
        Esp32BaseWeb::sendChunk("</b><span>当前模式</span></div><div><b>");
        snprintf(value, sizeof(value), "水路 %u", snapshot.zoneId);
        Esp32BaseWeb::sendChunk(value);
        Esp32BaseWeb::sendChunk("</b><span>正在出水</span></div><div><b>");
        snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(snapshot.pulses));
        Esp32BaseWeb::sendChunk(value);
        Esp32BaseWeb::sendChunk("</b><span>已累计脉冲</span></div></div>");
        if (snapshot.mode == CalibrationMode::ZoneStandardFlow) {
            Esp32BaseWeb::sendChunk("<div class='ir-calib-result'><div><b>");
            Esp32BaseWeb::writeHtmlEscaped(flowText);
            Esp32BaseWeb::sendChunk(" L/min</b><span>当前流速</span></div><div><b>");
            Esp32BaseWeb::sendChunk(snapshot.standardFlowStable ? "已稳定" : "未稳定");
            Esp32BaseWeb::sendChunk("</b><span>稳定判定</span></div><div><b>");
            Esp32BaseWeb::writeHtmlEscaped(suggestedText);
            Esp32BaseWeb::sendChunk(" L/min</b><span>建议标准流量</span></div></div>");
        }
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/calibration/action'><input type='hidden' name='action' value='stop'><div class='actions'><input class='danger' type='submit' value='停止校准'></div></form>");
        Esp32BaseWeb::endPanel();
    } else {
        sendCalibrationResultPanel(snapshot);
        sendVolumeSamplesPanel(snapshot);
        Esp32BaseWeb::beginPanel("校准流程");
        Esp32BaseWeb::sendChunk("<div class='ir-calib-steps'><div class='ir-calib-step'><span class='ir-step-no'>1</span><div><b>流量计接水校准</b><span class='ir-help'>采集 2-3 次接水样本，系统用差分/拟合得到脉冲/L。</span></div></div><div class='ir-calib-step'><span class='ir-step-no'>2</span><div><b>Zone 标准流量校准</b><span class='ir-help'>启动稳定时间后采集滑动窗口流速，稳定后保存 L/min。</span></div></div><div class='ir-calib-step'><span class='ir-step-no'>3</span><div><b>手工修正</b><span class='ir-help'>已知参数时可在校准结果、水路配置或设置页直接录入；浇水时长仍在运行或计划中设置。</span></div></div></div>");
        Esp32BaseWeb::endPanel();
        sendCalibrationStartPanel(snapshot);
    }

    Esp32BaseWeb::sendFooter();
}

void eventTimeToText(const Esp32BaseAppEventRecord& event, char* out, size_t len) {
    if (event.epochSec != 0 && Esp32BaseTime::formatEpoch(event.epochSec, out, len, "%Y-%m-%d %H:%M")) {
        return;
    }
    snprintf(out, len, "启动后 %lus", static_cast<unsigned long>(event.uptimeSec));
}

void writeEventObjectText(const char* value, size_t maxLen) {
    char text[64];
    size_t n = 0;
    while (n < maxLen && value[n] != '\0' && n < sizeof(text) - 1) {
        text[n] = value[n];
        ++n;
    }
    text[n] = '\0';
    if (strcmp(text, "controller") == 0) {
        Esp32BaseWeb::sendChunk("控制器");
    } else if (strcmp(text, "run") == 0) {
        Esp32BaseWeb::sendChunk("浇水任务");
    } else if (strcmp(text, "zone") == 0) {
        Esp32BaseWeb::sendChunk("水路");
    } else if (strcmp(text, "flow") == 0) {
        Esp32BaseWeb::sendChunk("流量计");
    } else if (strncmp(text, "plan:", 5) == 0) {
        Esp32BaseWeb::sendChunk("计划 ");
        Esp32BaseWeb::writeHtmlEscaped(text + 5);
    } else if (text[0] == '\0') {
        Esp32BaseWeb::sendChunk("无");
    } else {
        Esp32BaseWeb::writeHtmlEscaped(text);
    }
}

