tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void sendEventValues(const Esp32BaseAppEventRecord& event) {
    bool any = false;
    Esp32BaseWeb::sendChunk("<div class='ir-event-values'>");
    if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
        char buf[32];
        snprintf(buf, sizeof(buf), "<span class='ir-compact-item'>v1 %ld</span>", static_cast<long>(event.value1));
        Esp32BaseWeb::sendChunk(buf);
        any = true;
    }
    if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
        char buf[32];
        snprintf(buf, sizeof(buf), "<span class='ir-compact-item'>v2 %ld</span>", static_cast<long>(event.value2));
        Esp32BaseWeb::sendChunk(buf);
        any = true;
    }
    if (event.valueMask & Esp32BaseAppEventLog::VALUE3) {
        char buf[32];
        snprintf(buf, sizeof(buf), "<span class='ir-compact-item'>v3 %ld</span>", static_cast<long>(event.value3));
        Esp32BaseWeb::sendChunk(buf);
        any = true;
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<span class='ir-table-note'>无</span>");
    }
    Esp32BaseWeb::sendChunk("</div>");
}

void sendEventTableRow(const Esp32BaseAppEventRecord& event, void* user) {
    bool* any = static_cast<bool*>(user);
    if (any != nullptr) {
        *any = true;
    }
    char timeText[24];
    eventTimeToText(event, timeText, sizeof(timeText));
    char buf[256];
    snprintf(buf,
             sizeof(buf),
             "<tr><td class='num'>%lu</td><td>%s</td><td><div class='ir-event-summary'><b>%s</b><span class='ir-table-note'>%s · %s</span></div></td><td>",
             static_cast<unsigned long>(event.id),
             eventLevelLabel(event.level),
             eventSourceLabel(event.source),
             eventTypeLabel(event.type),
             eventReasonLabel(event.reason));
    Esp32BaseWeb::sendChunk(buf);
    writeEventObjectText(event.object, sizeof(event.object));
    Esp32BaseWeb::sendChunk("</td><td>");
    sendEventValues(event);
    snprintf(buf, sizeof(buf), "</td><td>%s</td><td><a class='btnlink info' href='/irrigation/events/detail?id=%lu'>详情</a></td></tr>",
             timeText,
             static_cast<unsigned long>(event.id));
    Esp32BaseWeb::sendChunk(buf);
}

const char* boolLabel(bool value) {
    return value ? "是" : "否";
}

void sendDetailTextRow(const char* name, const char* value, bool full = false) {
    Esp32BaseWeb::sendChunk(full ? "<div class='ir-detail-row full'><span>" : "<div class='ir-detail-row'><span>");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("</span><b>");
    Esp32BaseWeb::writeHtmlEscaped(value != nullptr && value[0] != '\0' ? value : "无");
    Esp32BaseWeb::sendChunk("</b></div>");
}

void sendDetailUintRow(const char* name, uint32_t value) {
    char buf[32];
    snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(value));
    sendDetailTextRow(name, buf);
}

void sendDetailIntRow(const char* name, int32_t value) {
    char buf[32];
    snprintf(buf, sizeof(buf), "%ld", static_cast<long>(value));
    sendDetailTextRow(name, buf);
}

void sendDetailHexRow(const char* name, uint32_t value) {
    char buf[32];
    snprintf(buf, sizeof(buf), "0x%08lX", static_cast<unsigned long>(value));
    sendDetailTextRow(name, buf);
}

void sendDetailBoolRow(const char* name, bool value) {
    sendDetailTextRow(name, boolLabel(value));
}

struct EventFindState {
    uint32_t id;
    bool found;
    Esp32BaseAppEventLog::StoreRecord item;
};

void findEventStoreRecord(const Esp32BaseAppEventLog::StoreRecord& item, void* user) {
    EventFindState* state = static_cast<EventFindState*>(user);
    if (state == nullptr || state->found) {
        return;
    }
    if (item.record.id == state->id) {
        state->item = item;
        state->found = true;
    }
}

void sendEventDetailSectionStart(const char* title) {
    Esp32BaseWeb::sendChunk("<div class='ir-detail-section'><h2>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</h2><div class='ir-detail-grid'>");
}

void sendEventDetailSectionEnd() {
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendEventTextDetailRow(const char* name, const char* value, size_t maxLen, bool full = false) {
    char text[80];
    size_t n = 0;
    while (n < maxLen && value[n] != '\0' && n < sizeof(text) - 1) {
        text[n] = value[n];
        ++n;
    }
    text[n] = '\0';
    sendDetailTextRow(name, text, full);
}

void sendEventDetail(const Esp32BaseAppEventLog::StoreRecord& item) {
    const Esp32BaseAppEventRecord& event = item.record;
    char timeText[32];
    eventTimeToText(event, timeText, sizeof(timeText));
    char levelText[32];
    snprintf(levelText, sizeof(levelText), "%s (%u)", eventLevelLabel(event.level), static_cast<unsigned>(event.level));
    char sourceText[80];
    snprintf(sourceText, sizeof(sourceText), "%s", eventSourceLabel(event.source));
    char typeText[80];
    snprintf(typeText, sizeof(typeText), "%s", eventTypeLabel(event.type));
    char reasonText[80];
    snprintf(reasonText, sizeof(reasonText), "%s", eventReasonLabel(event.reason));

    sendEventDetailSectionStart("基本信息");
    sendDetailUintRow("事件 ID", event.id);
    sendDetailTextRow("级别", levelText);
    sendDetailTextRow("来源", sourceText);
    sendDetailTextRow("事件类型", typeText);
    sendDetailTextRow("原因", reasonText);
    Esp32BaseWeb::sendChunk("<div class='ir-detail-row'><span>对象</span><b>");
    writeEventObjectText(event.object, sizeof(event.object));
    Esp32BaseWeb::sendChunk("</b></div>");
    sendDetailUintRow("代码 code", event.code);
    sendEventTextDetailRow("文本 text", event.text, sizeof(event.text), true);
    sendEventDetailSectionEnd();

    sendEventDetailSectionStart("时间信息");
    sendDetailTextRow("显示时间", timeText);
    sendDetailUintRow("epochSec", event.epochSec);
    sendDetailUintRow("bootId", event.bootId);
    sendDetailUintRow("uptimeSec", event.uptimeSec);
    sendEventDetailSectionEnd();

    sendEventDetailSectionStart("数值信息");
    sendDetailIntRow("value1", event.value1);
    sendDetailIntRow("value2", event.value2);
    sendDetailIntRow("value3", event.value3);
    sendDetailUintRow("valueMask", event.valueMask);
    sendEventDetailSectionEnd();

    sendEventDetailSectionStart("原始字段");
    sendDetailHexRow("magic", event.magic);
    sendEventTextDetailRow("source", event.source, sizeof(event.source));
    sendEventTextDetailRow("type", event.type, sizeof(event.type));
    sendEventTextDetailRow("reason", event.reason, sizeof(event.reason));
    sendEventTextDetailRow("object", event.object, sizeof(event.object), true);
    sendDetailUintRow("flags", event.flags);
    sendDetailUintRow("reserved", event.reserved);
    sendDetailUintRow("crc16", event.crc16);
    sendEventDetailSectionEnd();

