tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    sendEventDetailSectionStart("存储信息");
    sendDetailUintRow("slot", item.slot);
    sendDetailUintRow("index", item.index);
    sendDetailUintRow("offset", item.offset);
    sendDetailTextRow("状态", Esp32BaseAppEventLog::storeRecordStatusName(item.status));
    sendDetailUintRow("storedCrc16", item.storedCrc16);
    sendDetailUintRow("calculatedCrc16", item.calculatedCrc16);
    sendDetailBoolRow("readOk", item.readOk);
    sendDetailBoolRow("magicOk", item.magicOk);
    sendDetailBoolRow("levelOk", item.levelOk);
    sendDetailBoolRow("crcOk", item.crcOk);
    sendDetailBoolRow("committed", item.committed);
    sendEventDetailSectionEnd();
}

void handleEventDetailPage() {
    uint32_t id = 0;
    if (!parseU32Param("id", 1, 1000000000UL, 0, id)) {
        Esp32BaseWeb::sendText(400, "事件编号无效");
        return;
    }
    Esp32BaseAppEventLog::StoreInfo info;
    if (!Esp32BaseAppEventLog::readStoreInfo(info)) {
        Esp32BaseWeb::sendText(500, Esp32BaseAppEventLog::lastError());
        return;
    }
    EventFindState state = {};
    state.id = id;
    Esp32BaseAppEventLog::readStoreRecords(0, info.count, findEventStoreRecord, &state);
    if (!state.found) {
        Esp32BaseWeb::sendText(404, "事件不存在");
        return;
    }

    Esp32BaseWeb::sendHeader("事件详情");
    Esp32BaseWeb::sendPageTitle("事件详情", "事件记录的完整字段");
    Esp32BaseWeb::beginPanel("事件记录");
    sendEventDetail(state.item);
    Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink secondary' href='/irrigation/events'>返回事件</a></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void sendEventsTable(uint32_t page, uint32_t perPage, uint32_t total) {
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='ir-data-table'><thead><tr><th class='num'>编号</th><th>级别</th><th>事件摘要</th><th>对象</th><th>关键数值</th><th>时间</th><th>操作</th></tr></thead><tbody>");
    bool any = false;
    const uint32_t offset = (page - 1U) * perPage;
    if (offset <= 65535UL && perPage <= 65535UL) {
        Esp32BaseAppEventLog::readLatest(static_cast<uint16_t>(offset), static_cast<uint16_t>(perPage), sendEventTableRow, &any);
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='7'>暂无可显示的事件</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");

    Esp32BaseWeb::Pagination pagination = {"/irrigation/events", "", page, perPage, total};
    Esp32BaseWeb::sendPagination(pagination);
}

void sendHistoryTable(char* historyText) {
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='ir-data-table'><thead><tr><th class='num'>编号</th><th>来源</th><th>结果</th><th>原因</th><th>开始时间</th><th>结束时间</th><th class='num'>步骤数</th></tr></thead><tbody>");

    bool any = false;
    char* save = nullptr;
    for (char* line = strtok_r(historyText, "\n", &save); line != nullptr; line = strtok_r(nullptr, "\n", &save)) {
        while (*line == ' ' || *line == '\r' || *line == '\t') {
            ++line;
        }
        if (*line != '{') {
            continue;
        }

        StaticJsonDocument<1536> doc;
        if (deserializeJson(doc, line) != DeserializationError::Ok) {
            continue;
        }

        char started[24];
        char finished[24];
        epochToText(doc["startedAt"] | 0, started, sizeof(started));
        epochToText(doc["finishedAt"] | 0, finished, sizeof(finished));

        char row[448];
        snprintf(row,
                 sizeof(row),
                 "<tr><td class='num'>%lu</td><td>%s</td><td>%s</td><td>%s</td><td>%s</td><td>%s</td><td class='num'>%u</td></tr>",
                 static_cast<unsigned long>(doc["id"] | 0),
                 runSourceLabelFromString(doc["source"] | ""),
                 runResultLabelFromString(doc["result"] | ""),
                 runReasonLabelFromString(doc["reason"] | ""),
                 started,
                 finished,
                 static_cast<unsigned>(doc["stepCount"] | 0));
        Esp32BaseWeb::sendChunk(row);
        any = true;
    }

    if (!any) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='7'>暂无可显示的历史记录</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
}

void handleHistoryPage() {
    Esp32BaseWeb::sendHeader("浇水历史");
    Esp32BaseWeb::sendPageTitle("浇水历史", "手动浇水和自动计划的运行记录");
    uint32_t page = 1;
    uint32_t perPage = 10;
    readPagingParam("page", 1, 65535, 1, page);
    readPagingParam("per", 10, 50, 10, perPage);

    Esp32BaseWeb::beginPanel("浇水记录");
    uint32_t total = 0;
    if (!HistoryService::readPage(page, perPage, g_historyViewBuffer, sizeof(g_historyViewBuffer), total)) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "历史不可用", "读取浇水历史失败。");
    } else if (total == 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "暂无浇水历史", "手动浇水或自动计划完成、停止、故障后，会在这里显示记录。");
    } else {
        sendHistoryTable(g_historyViewBuffer);
        Esp32BaseWeb::Pagination pagination = {"/irrigation/history", "", page, perPage, total};
        Esp32BaseWeb::sendPagination(pagination);
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleEventsPage() {
    Esp32BaseWeb::sendHeader("事件");
    Esp32BaseWeb::sendPageTitle("事件", "系统、计划、校准和保护事件");
    uint32_t page = 1;
    uint32_t perPage = 10;
    readPagingParam("page", 1, 65535, 1, page);
    readPagingParam("per", 10, 50, 10, perPage);

    Esp32BaseAppEventLog::StoreInfo info;
    const bool ok = Esp32BaseAppEventLog::readStoreInfo(info);
    Esp32BaseWeb::beginPanel("事件记录");
    if (!ok) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "事件不可用", Esp32BaseAppEventLog::lastError());
    } else if (info.validCount == 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "暂无事件", "系统运行、计划触发、校准保存或保护动作会记录到这里。");
    } else {
        sendEventsTable(page, perPage, info.validCount);
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

} // namespace

void IrrigationWeb::registerRoutes() {
    Esp32BaseWeb::setHeadExtraCallback(sendIrrigationHeadExtra);
    Esp32BaseWeb::addPage("/irrigation", "首页", handleDashboardPage);
    Esp32BaseWeb::addPage("/irrigation/run", "运行", handleRunPage);
    Esp32BaseWeb::addPage("/irrigation/zones", "水路", handleZonesPage);
    Esp32BaseWeb::addPage("/irrigation/plans", "计划", handlePlansPage);
    Esp32BaseWeb::addPage("/irrigation/calibration", "校准", handleCalibrationPage);
    Esp32BaseWeb::addPage("/irrigation/settings", "设置", handleSettingsPage);
    Esp32BaseWeb::addPage("/irrigation/history", "浇水历史", handleHistoryPage);
    Esp32BaseWeb::addPage("/irrigation/events", "事件", handleEventsPage);
    Esp32BaseWeb::addRoute("/irrigation/events/detail", Esp32BaseWeb::METHOD_GET, handleEventDetailPage);
    Esp32BaseWeb::addRoute("/irrigation/run/start", Esp32BaseWeb::METHOD_POST, handleManualStartPost);
    Esp32BaseWeb::addRoute("/irrigation/run/plan-now", Esp32BaseWeb::METHOD_POST, handlePlanNowPost);
    Esp32BaseWeb::addRoute("/irrigation/run/stop", Esp32BaseWeb::METHOD_POST, handleStopPost);
    Esp32BaseWeb::addRoute("/irrigation/zones/edit", Esp32BaseWeb::METHOD_GET, handleZoneEditPage);
    Esp32BaseWeb::addRoute("/irrigation/zones/save", Esp32BaseWeb::METHOD_POST, handleZoneSavePost);
    Esp32BaseWeb::addRoute("/irrigation/plans/new", Esp32BaseWeb::METHOD_GET, handlePlanNewPage);
    Esp32BaseWeb::addRoute("/irrigation/plans/edit", Esp32BaseWeb::METHOD_GET, handlePlanEditPage);
    Esp32BaseWeb::addRoute("/irrigation/plans/create", Esp32BaseWeb::METHOD_POST, handlePlanCreatePost);
    Esp32BaseWeb::addRoute("/irrigation/plans/save", Esp32BaseWeb::METHOD_POST, handlePlanSavePost);
    Esp32BaseWeb::addRoute("/irrigation/plans/delete", Esp32BaseWeb::METHOD_POST, handlePlanDeletePost);
    Esp32BaseWeb::addRoute("/irrigation/calibration/action", Esp32BaseWeb::METHOD_POST, handleCalibrationPost);
    Esp32BaseWeb::addRoute("/irrigation/settings/save", Esp32BaseWeb::METHOD_POST, handleSettingsSavePost);
    Esp32BaseWeb::addApi("/api/status", handleStatusApi);
    Esp32BaseWeb::addApi("/api/run/current", handleStatusApi);
    Esp32BaseWeb::addApi("/api/zones", handleZonesApi);
    Esp32BaseWeb::addApi("/api/plans", handlePlansApi);
    Esp32BaseWeb::addApi("/api/calibration", handleCalibrationApi);
    Esp32BaseWeb::addApi("/api/history", handleHistoryApi);
    Esp32BaseWeb::addNavItem("/irrigation", "首页");
}

} // namespace Irrigation
